adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- File naming: <vendor>_<part/series name>_svd.xml -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Nordic Semiconductor</vendor>
  <vendorID>Nordic</vendorID>
  <name>nrf5001</name>
  <series>nRF50</series>
  <version>1</version>
  <description>nRF5xx reference description for system-on-chip with ARM 32-bit Cortex-M microcontroller</description>
  <licenseText>
Copyright (c) 2010 - 2020, Nordic Semiconductor ASA

All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form, except as embedded into a Nordic
   Semiconductor ASA integrated circuit in a product or a software update for
   such product, must reproduce the above copyright notice, this list of
   conditions and the following disclaimer in the documentation and/or other
   materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

4. This software, with or without modification, must only be used with a
   Nordic Semiconductor ASA integrated circuit.

5. Any software provided in binary form under this license must not be reverse
   engineered, decompiled, modified and/or disassembled.

THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
      </licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <headerDefinitionsPrefix>NRF_</headerDefinitionsPrefix>
  <cpu>
    <name>CM0</name>
    <revision>r0p4</revision>
    <endian>little</endian>
    <mpuPresent>0</mpuPresent>
    <fpuPresent>0</fpuPresent>
    <nvicPrioBits>2</nvicPrioBits>
    <vendorSystickConfig>0</vendorSystickConfig>
    <deviceNumInterrupts>32</deviceNumInterrupts>
    <sauNumRegions>0</sauNumRegions>
  </cpu>
  <headerSystemFilename>system_nrf5001</headerSystemFilename>
  <vendorExtensions>
    <MaxInterrupts>32</MaxInterrupts>
  </vendorExtensions>
  <peripherals>
    <peripheral>
      <name>FICR</name>
      <description>Factory Information Configuration Registers</description>
      <baseAddress>0x10000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>FICR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CHIPCONF00</name>
          <description>Unspecified</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LVLPULPALWAYSON</name>
              <description>Force LVLP ULP regulators to be always on</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>CKPUREEN</name>
              <description>Enable clock gate in clock purifier. Should always be 1.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CLOCKREQFILTERDISABLE</name>
              <description>Disable glitch-filter on clock sources powerup and standby lines</description>
              <lsb>2</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XOSC32M</name>
                  <description>Disable glitch-filter on powerUp- and standby lines to XOSC32M</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32ki</name>
                  <description>Disable glitch-filter on powerUp line to Rosc/Xosc/Synth used in clock system A (32ki)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64M</name>
                  <description>Disable glitch-filter on powerUp line to PLL used in clock system B (64M)</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVLPULPALWAYSHIGH</name>
              <description>Control the output voltage for LVLP</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>PLL_CALIB_ROSC</name>
              <description>HFCLK ring oscillator trim codes. Previous name: HFROSCTRIM.</description>
              <lsb>6</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>DISABLEREGULATORCLOCKFORCING</name>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>RC32KICLOCKSYNCDISABLE</name>
              <description>Disable synchronizer on calibration clock request from Rc32kiGenerator.</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>RCOSC32KICALLENGTH</name>
              <description>32kHz RC oscillator calibration length in number of cycles</description>
              <lsb>13</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>N64</name>
                  <description>64 cycles</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N128</name>
                  <description>128 cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N256</name>
                  <description>256 cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N512</name>
                  <description>512 cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCOSC32KICOARSEIN</name>
              <description>RCOSC coarse calibration input</description>
              <lsb>15</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>RSTVTHTRIM</name>
              <description>Threshold trim, power on reset</description>
              <lsb>21</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>BGREFTRIM</name>
              <description>Master bias bandgap trim</description>
              <lsb>26</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF01</name>
          <description>Unspecified</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>VREFULPTRIM</name>
              <description>RST low power voltage reference trim</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>VREGANAVOUT</name>
              <description>Control the output voltage for VREGRADIO (AVDD_1V3)</description>
              <lsb>4</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>VREGANAULPCAL</name>
              <description>VREGANA ULP output voltage calibration</description>
              <lsb>6</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>Min voltage</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEF</name>
                  <description>Default voltage</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>Max voltage</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREGMAINVOLT</name>
              <description>Control the output voltage for VREGMAIN</description>
              <lsb>11</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>VREGMAINICMPTIMER</name>
              <description>Control the stay-alive time for VDD2 current comparator</description>
              <lsb>15</lsb>
              <msb>30</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF02</name>
          <description>Unspecified</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>VREGMAINULPCAL</name>
              <description>Calibration of ULP regulator on VREGMAIN</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>VREGMAINULPICMPCAL</name>
              <description>Calibration of current comparator on VREGMAIN</description>
              <lsb>4</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>AMLICLOCKDELAY</name>
              <description>Trim value for AMLI clock delay</description>
              <lsb>7</lsb>
              <msb>12</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF03</name>
          <description>Unspecified</description>
          <addressOffset>0x10</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CHIPCONF04</name>
          <description>Unspecified</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
        </register>
        <cluster>
          <name>SOCINFO</name>
          <description>Unspecified</description>
          <headerStructName>FICR_SOCINFO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x130</addressOffset>
          <register>
            <name>PARTNO</name>
            <description>Part number of the device.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000014</resetValue>
            <fields>
              <field>
                <name>PARTNO</name>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>nRF5001</name>
                    <description>nRF5001 (Dagger52)</description>
                    <value>0x00000014</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>nRF5002</name>
                    <description>nRF5002 (Shoto)</description>
                    <value>0x00000015</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>HWREVISION</name>
            <description>Hardware Revision of the device. Will be updated in production test.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>HWREVISION</name>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Rev1</name>
                    <description>Unspecified</description>
                    <value>0x00000000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PRODUCTIONREVISION</name>
            <description>Production revision of the device. Will be updated in production test.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
          </register>
        </cluster>
        <cluster>
          <name>INFO</name>
          <description>Device info</description>
          <headerStructName>FICR_INFO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x200</addressOffset>
          <register>
            <name>CONFIGID</name>
            <description>Configuration identifier</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>HWID</name>
                <description>Identification number for the HW</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DEVICEID[%s]</name>
            <description>Description collection: Device identifier</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>DEVICEID</name>
                <description>64 bit unique device identifier</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PART</name>
            <description>Part code</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PART</name>
                <description>Part code</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VARIANT</name>
            <description>Part Variant, Hardware version and Production configuration</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>VARIANT</name>
                <description>Part Variant, Hardware version and Production configuration, encoded as ASCII</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKAGE</name>
            <description>Package option</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PACKAGE</name>
                <description>Package option</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RAM</name>
            <description>RAM variant</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>RAM</name>
                <description>RAM variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K8</name>
                    <description>8 kByte RAM</description>
                    <value>0x00000008</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MTP</name>
            <description>MTP variant</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>MTP</name>
                <description>MTP variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K92</name>
                    <description>92 kByte NVM</description>
                    <value>0x0000005C</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CODEPAGESIZE</name>
            <description>Code memory page size in bytes</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000800</resetValue>
            <fields>
              <field>
                <name>CODEPAGESIZE</name>
                <description>Code memory page size in bytes</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K2048</name>
                    <description>2 kByte</description>
                    <value>0x00000800</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CODESIZE</name>
            <description>Code memory size</description>
            <addressOffset>0x024</addressOffset>
            <access>read-only</access>
            <resetValue>0x0000002E</resetValue>
            <fields>
              <field>
                <name>CODESIZE</name>
                <description>Code memory size in number of pages</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>P46</name>
                    <description>46 pages</description>
                    <value>0x0000002E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DEVICETYPE</name>
            <description>Device type</description>
            <addressOffset>0x028</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DEVICETYPE</name>
                <description>Device type</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Die</name>
                    <description>Device is an physical DIE</description>
                    <value>0x00000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FPGA</name>
                    <description>Device is an FPGA</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
