adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>NVMC</name>
      <description>Non Volatile Memory Controller</description>
      <baseAddress>0x40023000</baseAddress>
      <alternatePeripheral>BPROT</alternatePeripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>NVMC</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>READY</name>
          <description>Ready flag</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>READY</name>
              <description>NVMC is ready or busy</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>NVMC is busy (on-going write or erase operation)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>NVMC is ready</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>READYNEXT</name>
          <description>Ready flag</description>
          <addressOffset>0x408</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>READYNEXT</name>
              <description>NVMC can accept a new write operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>NVMC cannot accept any write operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>NVMC is ready</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTWORDSTATE</name>
          <description>Test word status</description>
          <addressOffset>0x40C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STATE</name>
              <description>State of the least significant bit in the test word</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Erased</name>
                  <description>Erased</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InvPgm</name>
                  <description>Inverse programmed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Written0</name>
                  <description>Written 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Written1</name>
                  <description>Written 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>Configuration register</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>WEN</name>
              <description>Program memory access mode. It is strongly recommended to only activate erase and write modes when they are actively used.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ren</name>
                  <description>Read only access</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Wen</name>
                  <description>Write enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Een</name>
                  <description>Erase enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTERTNALVPP</name>
              <description>Enable external VPP for write and page erase operations</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InternalVpp</name>
                  <description>Use internal charge pump</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ExternalVpp</name>
                  <description>Use external VPP</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODENVMAUTO</name>
              <description>Handling MODE signals of the non-volatile memory macro</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Auto</name>
                  <description>Handled automatically by the non-volatile memory controller</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Manual</name>
                  <description>Set by CONFIG.MODENVM register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERASEPAGECONFIG</name>
              <description>Page erase configuration</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ReProgramErase</name>
                  <description>Erase after re-programming the data read and inverse program</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InverseProgramErase</name>
                  <description>Erase after inverse program</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Erase</name>
                  <description>Just erase (no re-program and inverse program)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODENVM</name>
              <description>MODE signals of the non-volatile memory macro</description>
              <lsb>12</lsb>
              <msb>18</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPAGE</name>
          <description>Register for erasing a page in code area</description>
          <addressOffset>0x508</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ERASEPAGE</name>
              <description>Register for starting erase of a page in code area</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEALL</name>
          <description>Register for erasing all non-volatile user memory</description>
          <addressOffset>0x50C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ERASEALL</name>
              <description>Erase all non-volatile memory including UICR registers. The erase must be enabled using CONFIG.WEN before the non-volatile memory can be erased.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoOperation</name>
                  <description>No operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Erase</name>
                  <description>Start chip erase</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEUICR</name>
          <description>Register for erasing whole UICR page</description>
          <addressOffset>0x514</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ERASEUICR</name>
              <description>Erase UICR page. The erase must be enabled using CONFIG.WEN before the non-volatile memory can be erased.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoOperation</name>
                  <description>No operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Erase</name>
                  <description>Start chip erase</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WAITSTATENUM</name>
          <description>Register to set the number of wait-state for non-volatile memory access. To update the WAITSTATENUM field, the ACCESSCODE must be correct.</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000070</resetValue>
          <fields>
            <field>
              <name>WAITSTATENUM</name>
              <description>Non-volatile memory wait-states</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>WAITSTATENUMICELL</name>
              <description>Wait-states used while cell current test (set by CONFIG.MODENVM register)</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ACCESSCODE</name>
              <description>Access code for modifying this register</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTWORD</name>
          <description>Test the programming state of the least significant bit in a word</description>
          <addressOffset>0x534</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>Address of the test word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>VSELREAD</name>
          <description>Select output voltage of power generator for read mode</description>
          <addressOffset>0x560</addressOffset>
          <access>read-write</access>
          <resetValue>0x10000000</resetValue>
          <fields>
            <field>
              <name>VWLSEL</name>
              <description>Control the VWLSEL signal</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>VPPSEL</name>
              <description>Control the VPPSEL signal</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>VEESEL</name>
              <description>Control the VEESEL signal</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>VSELWRITE</name>
          <description>Select output voltage of power generator for write mode</description>
          <addressOffset>0x564</addressOffset>
          <access>read-write</access>
          <resetValue>0x10000000</resetValue>
          <fields>
            <field>
              <name>VWLSEL</name>
              <description>Control the VWLSEL signal</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>VPPSEL</name>
              <description>Control the VPPSEL signal</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>VEESEL</name>
              <description>Control the VEESEL signal</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>VSELERASE</name>
          <description>Select output voltage of power generator for erase mode</description>
          <addressOffset>0x568</addressOffset>
          <access>read-write</access>
          <resetValue>0x10000000</resetValue>
          <fields>
            <field>
              <name>VWLSEL</name>
              <description>Control the VWLSEL signal</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>VPPSEL</name>
              <description>Control the VPPSEL signal</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>VEESEL</name>
              <description>Control the VEESEL signal</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTMODE</name>
          <description>Register for entering test mode. Refer to the MTP IP test documentation for more details.</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TESTMODE</name>
              <description>Register for entering test mode. Refer to the MTP IP test documentation for more details. This register does not return the same value as written.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Read: Not in test-mode.</description>
                  <value>0x0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TESTMODE1</name>
                  <description>Read: In test-mode 1.</description>
                  <value>0x0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TESTMODE2</name>
                  <description>Read: In test-mode 2.</description>
                  <value>0x0002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TESTMODE3</name>
                  <description>Read: In test-mode 3.</description>
                  <value>0x0004</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>SetNORMAL</name>
                  <description>Write: Sets NORMAL mode.</description>
                  <value>0x0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetTESTMODE1</name>
                  <description>Write: Sets test-mode 1.</description>
                  <value>0xBCDE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetTESTMODE2</name>
                  <description>Write: Sets test-mode 2.</description>
                  <value>0xABCD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetTESTMODE3</name>
                  <description>Write: Sets test-mode 3.</description>
                  <value>0xCDEF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTMASSERASE</name>
          <description>Self-timed mass-erase operation</description>
          <addressOffset>0x610</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TESTMASSERASE</name>
              <description>Self-timed mass-erase operation</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EVERYTHING</name>
                  <description>Erase everything (all information pages and main block)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOOPERATION2</name>
                  <description>No operation</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOOPERATION1</name>
                  <description>No operation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOOPERATION0</name>
                  <description>No operation</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TESTDATA128[%s]</name>
          <description>Description collection: Direct MTP test data word n</description>
          <addressOffset>0x620</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TESTDATA</name>
              <description>Returns data out from MTP when reading. Sets MTP data in when writing.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TESTDATA128INC[%s]</name>
          <description>Description collection: Direct MTP test data word n. Post-increments TESTCONTROLADDR</description>
          <addressOffset>0x630</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TESTDATA</name>
              <description>Returns data out from MTP when reading. Use TESTDATA128[1:0] registers to set the compared data. Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.CE is high, the read starts by pulsing the CE line low for tNRL. If TESTCONTROLLINES.CE is low, CE remains low for the whole access.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTCMPINC</name>
          <description>Reads and compares last MTP row to TESTDATA128 content. Post-increments TESTCONTROLADDR.</description>
          <addressOffset>0x640</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DIRECT</name>
              <description>Reads and compares last MTP row (direct lines) to TESTDATA128 content. Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.CE is high, the read starts by pulsing the CE line low for tNRL. If TESTCONTROLLINES.CE is low, CE remains low for the whole access.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Equal</name>
                  <description>Direct TESTDATA128 content and MTP row read are equal</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotEqual</name>
                  <description>Direct TESTDATA128 content and MTP row read are different</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LATCHED</name>
              <description>Reads and compares last MTP row (latched lines) to TESTDATA128 content. Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.CE is high, the read starts by pulsing the CE line low for tNRL. If TESTCONTROLLINES.CE is low, CE remains low for the whole access.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Equal</name>
                  <description>Latched TESTDATA128 content and MTP row read are equal</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotEqual</name>
                  <description>Latched TESTDATA128 content and MTP row read are different</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
