adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001.svd
        <register>
          <name>TESTNCMPINC</name>
          <description>Reads and compares last MTP row to complement of TESTDATA128 content. Post-increments TESTCONTROLADDR.</description>
          <addressOffset>0x644</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DIRECT</name>
              <description>Reads and compares last MTP row (direct lines) to the complement of TESTDATA128 content (all bits inverted). Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.CE is high, the read starts by pulsing the CE line low for tNRL. If TESTCONTROLLINES.CE is low, CE remains low for the whole access.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Complement</name>
                  <description>Direct TESTDATA128 content and MTP row read are each-other's complement</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotComplement</name>
                  <description>Direct TESTDATA128 content and MTP row read are not each-other's complement</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LATCHED</name>
              <description>Reads and compares last MTP row (latched lines) to the complement of TESTDATA128 content (all bits inverted). Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.CE is high, the read starts by pulsing the CE line low for tNRL. If TESTCONTROLLINES.CE is low, CE remains low for the whole access.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Complement</name>
                  <description>Latched TESTDATA128 content and MTP row read are each-other's complement</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotComplement</name>
                  <description>Latched TESTDATA128 content and MTP row read are not each-other's complement</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTCONTROLLINES</name>
          <description>Direct MTP test, control lines. Refer to the MTP IP documentation for more details.</description>
          <addressOffset>0x648</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>Control the MODE signal</description>
              <lsb>23</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>CE</name>
              <description>Control the CE signal</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>RSTB</name>
              <description>Control the RSTB signal</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTCONTROLADDR</name>
          <description>Direct MTP test control, address lines</description>
          <addressOffset>0x64C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XADDR</name>
              <description>Control the X address signal</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>YADDR</name>
              <description>Control the YADDR signal</description>
              <lsb>8</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>SADDR</name>
              <description>Control the SADDR signal</description>
              <lsb>11</lsb>
              <msb>13</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTCOUNTERRELOAD</name>
          <description>Counter reload value, used when counting from CE rising edge to latching of data</description>
          <addressOffset>0x650</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RELOAD</name>
              <description>Counter reload value, in MCU bus cycles, used when counting from CE rising edge to latching of data. Value of 0 has no effect (counter will not latch)</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTCOUNTERRUNNING</name>
          <description>Returns the state (counting or not) of the counter</description>
          <addressOffset>0x654</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUNNING</name>
              <description>Returns the state of the counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotRunning</name>
                  <description>Counter is not running</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Running</name>
                  <description>Counter is running</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTCONFIG</name>
          <description>Mode of operation of the counter</description>
          <addressOffset>0x658</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Returns the state of the counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Counter is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Counter is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Defines the starting point of the counter</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CE</name>
                  <description>Counter starts on CE rising edge</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOINC</name>
              <description>Controls the address auto-increment or -decrement</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Increment</name>
                  <description>Address is auto-incrementing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Decrement</name>
                  <description>Address is auto-decrementing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOINCEN</name>
              <description>Disables the address auto-increment or -decrement</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Address auto-incrementing/decrementing is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Address auto-incrementing/decrementing is enabled</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTMEASVPPEN</name>
          <description>Controls analog signals for MTP measurements</description>
          <addressOffset>0x65C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MEASEN</name>
              <description>Analog enable for Cell Current Measurement Port. Needs to be set when measuring MEAS on P0.00.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>MEAS pad disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>MEAS pad enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ATBEN</name>
              <description>Enable the analog test bus (ATB) connecting VEEE and VWLE from MTP. The VPP has dedicated pin called DECP.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>ATB disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>ATB enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTPOWERCONTROL</name>
          <description>Direct test, control lines to the MTP power generator module. Refer to the MTP IP documentation for more details.</description>
          <addressOffset>0x660</addressOffset>
          <access>read-write</access>
          <resetValue>0x10000000</resetValue>
          <fields>
            <field>
              <name>VEESEL</name>
              <description>Control the VEESEL signal</description>
              <lsb>12</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>VPPSEL</name>
              <description>Control the VPPSEL signal</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>VWLSEL</name>
              <description>Control the VWLSEL signal</description>
              <lsb>20</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>VMODE</name>
              <description>Control the VMODE signal</description>
              <lsb>24</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>CLKEN</name>
              <description>Enable clock from PCGC to the CLK signal</description>
              <lsb>28</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>ERS</name>
              <description>Control the ERS (erase enable) signal</description>
              <lsb>29</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>PGM</name>
              <description>Control the PGM (program enable) signal</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>RD</name>
              <description>Control the RD (read enable) signal</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCEONNVM</name>
          <description>Force on NVM supply</description>
          <addressOffset>0x700</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCEONNVM</name>
              <description>Force on NVM supply</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DoNotForceOn</name>
                  <description>Do not force on NVM supply</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceOn</name>
                  <description>Force on NVM supply</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCEOFFNVM</name>
          <description>Force off NVM supply</description>
          <addressOffset>0x728</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCEOFFNVM</name>
              <description>Force off NVM supply</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotForcedOff</name>
                  <description>Read: NVM supply not forced off</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForcedOff</name>
                  <description>Read: NVM supply force off</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>DisableForceOff</name>
                  <description>Write: Do not force off NVM supply</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnableForceOff</name>
                  <description>Write: Force off NVM supply</description>
                  <value>0xACCE5500</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
