adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PCGCSLAVE_AMLI</name>
      <description>PCGCSlave</description>
      <baseAddress>0x41000000</baseAddress>
      <headerStructName>PCGCSLAVE</headerStructName>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>PCGCSLAVE</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TRIGZEROPENALTY</name>
          <description>Trigger zero penalty</description>
          <addressOffset>0x078</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>TRIGGER</name>
              <description>TRIGGER</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Trigger zero penalty</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIGFULLPENALTY</name>
          <description>Trigger full penalty</description>
          <addressOffset>0x07C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>TRIGGER</name>
              <description>TRIGGER</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Trigger full penalty</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PENALTY[%s]</name>
          <description>Description collection: Penalty level for power/clock pair n</description>
          <addressOffset>0xC00</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PENALTY</name>
              <description>Penalty level</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FORCEOVERRIDE[%s]</name>
          <description>Description collection: Force override of power/clock pair n</description>
          <addressOffset>0xC80</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>CLOCKFORCINGPRE</name>
              <description>CLOCKFORCINGPRE</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>DOFORCECLOCKPRE</name>
              <description>DOFORCECLOCKPRE</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>POWERFORCINGPRE</name>
              <description>POWERFORCINGPRE</description>
              <lsb>8</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>DOFORCEPOWERPRE</name>
              <description>DOFORCEPOWERPRE</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PCGCMASTER0</name>
      <description>PCGC Master</description>
      <baseAddress>0x41001000</baseAddress>
      <headerStructName>PCGCMASTER</headerStructName>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>PCGCMASTER</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SETPWRCONTHRESHOLDBASE[%s]</name>
          <description>Description collection: Set power consumption threshold base for power source / regulator n</description>
          <addressOffset>0x0E0</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>SETPWRCONTHRESHOLDBASE</name>
              <description>SETPWRCONTHRESHOLDBASE</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SETPOWERCONSUMPTIONBASE[%s]</name>
          <description>Description collection: Set power consumption base for power/clock pair n</description>
          <addressOffset>0x100</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>POWERREQUIREMENT</name>
              <description>POWERREQUIREMENT</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UNLOCKBACKDOORS</name>
          <description>Unlock backdoors</description>
          <addressOffset>0xC00</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>UNLOCKBACKDOORS</name>
              <description>Write: 0x00009375 to lock/unlock backdoors Read:  0x00000001 if backdoors is enabled Read:  0x00000000 if backdoors is disabled</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLEPOWERREGFORCE</name>
          <description>Enable power reg force</description>
          <addressOffset>0xC04</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ENABLEPOWERREGFORCE</name>
              <description>ENABLEPOWERREGFORCE</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>POWERREGFORCE</name>
          <description>Force reg</description>
          <addressOffset>0xC08</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>POWERREGFORCEREG</name>
              <description>POWERREGFORCEREG</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MASTERFORCEREG</name>
          <description>Force reg</description>
          <addressOffset>0xC10</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ENABLEPSWITCHFORCE</name>
              <description>ENABLEPSWITCHFORCE</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>PSWITCHFORCEPRE</name>
              <description>PSWITCHFORCEPRE</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>ENABLEISOLATIONFORCE</name>
              <description>ENABLEISOLATIONFORCE</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>ISOLATIONFORCEPRE</name>
              <description>ISOLATIONFORCEPRE</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>ENABLEARSTFORCE</name>
              <description>ENABLEARSTFORCE</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>VALUEARSTFORCEPRE</name>
              <description>VALUEARSTFORCEPRE</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>ENABLEPOWERONFORCE</name>
              <description>ENABLEPOWERONFORCE</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>POWERONFORCEPRE</name>
              <description>POWERONFORCEPRE</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x5</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CLOCKFORCEREG[%s]</name>
          <description>Description collection: Force clock n</description>
          <addressOffset>0xD00</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable clock forcing</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>CLOCKFORCING</name>
              <description>CLOCKFORCING</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CLOCKSOURCEFORCING</name>
              <description>CLOCKSOURCEFORCING</description>
              <lsb>2</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
