adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AMLI</name>
      <description>AHB Multi-Layer Interface</description>
      <baseAddress>0x41000000</baseAddress>
      <alternatePeripheral>PCGCSLAVE_AMLI</alternatePeripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>AMLI</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>RAMPRI</name>
          <description>RAM configurable priority configuration structure</description>
          <headerStructName>AMLI_RAMPRI</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>CPU</name>
            <description>AHB bus master priority register for CPU</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>RAM0</name>
                <description>Priority register for RAM AHB slave 0</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM1</name>
                <description>Priority register for RAM AHB slave 1</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PERI</name>
            <description>AHB bus master priority register for periperals</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>RAM0</name>
                <description>Priority register for RAM AHB slave 0</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM1</name>
                <description>Priority register for RAM AHB slave 1</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>USB</name>
            <description>AHB bus master priority register for USB</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>RAM0</name>
                <description>Priority register for RAM AHB slave 0</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM1</name>
                <description>Priority register for RAM AHB slave 1</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRLAP</name>
            <description>AHB bus master priority register for CTRL-AP</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>RAM0</name>
                <description>Priority register for RAM AHB slave 0</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RAM1</name>
                <description>Priority register for RAM AHB slave 1</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
