adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>REGULATORS</name>
      <description>Regulator control</description>
      <baseAddress>0x40001000</baseAddress>
      <alternatePeripheral>OSCILLATORS</alternatePeripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>REGULATORS</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>MAINREGSTATUS</name>
          <description>Main supply status</description>
          <addressOffset>0x428</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VREGUSB</name>
              <description>VREGUSB status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Voltage supplied on VDD.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Voltage supplied on VREGUSB.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DISABLEHPBOR</name>
          <description>Enable or disable HPBOR</description>
          <addressOffset>0x434</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DISABLE</name>
              <description>Enable or disable HPBOR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable HPBOR</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable HPBOR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTEMOFF</name>
          <description>System OFF register</description>
          <addressOffset>0x500</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>SYSTEMOFF</name>
              <description>Enable System OFF mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enter</name>
                  <description>Enable System OFF mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>POFSTAT</name>
          <description>Power-fail comparator status register</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>COMPARATOR</name>
              <description>Power-fail comparator status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Above</name>
                  <description>Detected voltage is above VPOF threshold</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Below</name>
                  <description>Detected voltage is below VPOF threshold.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>POFCON</name>
          <description>Power-fail comparator configuration</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>POF</name>
              <description>Enable or disable power-fail comparator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THRESHOLD</name>
              <description>Power-fail comparator threshold setting</description>
              <lsb>1</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V17</name>
                  <description>Set threshold to 1.7 V for VBUS, or 0.90 V for VDD</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V18</name>
                  <description>Set threshold to 1.8 V for VBUS, or 0.95 V for VDD</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V19</name>
                  <description>Set threshold to 1.9 V for VBUS, or 1.00 V for VDD</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V20</name>
                  <description>Set threshold to 2.0 V for VBUS, or 1.05 V for VDD</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V21</name>
                  <description>Set threshold to 2.1 V for VBUS, or 1.10 V for VDD</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V22</name>
                  <description>Set threshold to 2.2 V for VBUS, or 1.15 V for VDD</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V23</name>
                  <description>Set threshold to 2.3 V for VBUS, or 1.20 V for VDD</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V24</name>
                  <description>Set threshold to 2.4 V for VBUS, or 1.25 V for VDD</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V25</name>
                  <description>Set threshold to 2.5 V for VBUS, or 1.30 V for VDD</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V26</name>
                  <description>Set threshold to 2.6 V for VBUS, or 1.35 V for VDD</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V27</name>
                  <description>Set threshold to 2.7 V for VBUS, or 1.40 V for VDD</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V28</name>
                  <description>Set threshold to 2.8 V for VBUS, or 1.45 V for VDD</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V29</name>
                  <description>Set threshold to 2.9 V for VBUS, or 1.50 V for VDD</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V30</name>
                  <description>Set threshold to 3.0 V for VBUS, or 1.55 V for VDD</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V31</name>
                  <description>Set threshold to 3.1 V for VBUS, or 1.60 V for VDD</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V32</name>
                  <description>Set threshold to 3.2 V for VBUS, or 1.65 V for VDD</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTDIS</name>
              <description>Bypass power-fail comparator hysteresis</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Hysteresis active</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NoHyst</name>
                  <description>Hysteresis disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVENTDISABLE</name>
              <description>Disable the POFWARN power-fail warning event</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>POFWARN event is generated.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>POFWARN event is not generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL</name>
              <description>Power-fail comparator input selector</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDD</name>
                  <description>POF measures or monitors the VDD supply voltage pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VMON</name>
                  <description>POF measures or monitors the BATMON pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IGNOREDAPCPWRREGMODE</name>
          <description>Ignore DAPCP power mode</description>
          <addressOffset>0x514</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>IGNOREDAPCPWRREGMODE</name>
              <description>Ignore power request from debugger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DoNotIgnore</name>
                  <description>Do not ignore power request from debugger</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore power request from debugger</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTVTHTRIM</name>
          <description>Threshold trim, power-on reset</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RSTVTHTRIM</name>
              <description>Threshold trim, power-on reset</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BGREFTRIM</name>
          <description>Master bias bandgap trim</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BGREFTRIM</name>
              <description>Threshold trim, brown-out reset for VDDL battery</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ATEPOWER</name>
          <description>Analog test bus control for power modules</description>
          <addressOffset>0x588</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
        </register>
        <register>
          <name>VREFULPTRIM</name>
          <description>Trim value of VREF_ULP</description>
          <addressOffset>0x58C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VREFULPTRIM</name>
              <description>Trim value of VREF_ULP Default 4'b0011</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCEVBUSDET</name>
          <description>Force VBUS detection indication</description>
          <addressOffset>0x5E8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCEVBUSDET</name>
              <description>Force VBUS detection indication, overriding the analog detection circuitry</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DoNotForce</name>
                  <description>Do not force VBUS detection output</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceNoVbusDet</name>
                  <description>Force detection output to 'no VBUS present'</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DoNotForce2</name>
                  <description>Do not force VBUS detection output (same effect as DoNotForce)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceVbusDet</name>
                  <description>Force detection output to 'VBUS present'</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>VREGANA</name>
          <description>Unspecified</description>
          <headerStructName>REGULATORS_VREGANA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x900</addressOffset>
          <register>
            <name>VOUT</name>
            <description>Control the output voltage</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VOUT</name>
                <description>Output voltage</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>00</name>
                    <description>1.0 V</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>1.05 V</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>1.10 V</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>11</name>
                    <description>1.20 V</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DCDCEN</name>
            <description>Enable DC/DC operation of the regulator</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DCDCEN</name>
                <description>Enable or disable DC/DC converter</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ENFORCEPWRREGMODE</name>
            <description>Enable forcing of power mode in power regulator</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>ENFORCEPWRREGMODE</name>
                <description>Enable forcing of power mode in power regulator</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Power regulator forcing off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Power regulator mode forced to value given by FORCEREGMODE</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEREGMODE</name>
            <description>Backdoor register for manual selection of power mode</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>FORCEREGMODE</name>
                <description>Force regulator mode to value</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Ext</name>
                    <description>Force external</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ULP</name>
                    <description>Force ULP mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO</name>
                    <description>Force LDO mode</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DCDC</name>
                    <description>Force DC/DC mode</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REF</name>
                    <description>Force REF mode</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CURRENTPWRREGMODE</name>
            <description>Current mode in the power regulator</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>CURRENTPWRREGMODE</name>
                <description>Current mode in the power regulator</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Ext</name>
                    <description>External</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DCDC</name>
                    <description>DC/DC</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REF</name>
                    <description>REF</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO</name>
                    <description>ULP DC/DC</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO_DCDC</name>
                    <description>LDO DC/DC</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO_REF</name>
                    <description>LDO REF</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ULP</name>
                    <description>ULP</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DCDC_ULP</name>
                    <description>ULP DC/DC</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REF_ULP</name>
                    <description>REF ULP</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ULP_LDO</name>
                    <description>ULP DC/DC</description>
                    <value>0xC</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
