adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001.svd
        <register>
          <name>MISC_TEST1</name>
          <description>Misc Aaf/ADC trim related</description>
          <addressOffset>0x594</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>RFMIXDCCALI</name>
              <description>AAF/RFMIX dc calibration of I channel</description>
              <lsb>6</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>RFMIXDCCALQ</name>
              <description>AAF/RFMIX dc calibration of Q channel</description>
              <lsb>13</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>AAFCALOVREN</name>
              <description>0: override with values in PAR1 1: use values from CalibrationEngineCore</description>
              <lsb>20</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>AAFENDCCAL</name>
              <description>Enable DCCAL</description>
              <lsb>21</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>OVRENRFMIXDCCAL</name>
              <description>if '1' enable override for RFMIXDCCALI/Q. RfMix calibration must only be run after the radio is fully powered up.</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_TEST2</name>
          <description>Misc Aaf/ADC trim related</description>
          <addressOffset>0x598</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADCCALCII</name>
              <description>ADC calibration current in 'I' comparator.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>ADCCALSIGNI</name>
              <description>ADC cal sign for I</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>ADCCALCIQ</name>
              <description>ADC calibration current in 'Q' comparator.</description>
              <lsb>6</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>ADCCALSIGNQ</name>
              <description>ADC cal sign for Q</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>ADCOFFSETCALOVREN</name>
              <description>1: override with values in SPI 0: use values from CalibrationEngineCore</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>ADCRINGOSCCALOVREN</name>
              <description>1: override with values in SPI 0: use values from CalibrationEngineCore</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>TXMODOVRVAL</name>
              <description>txModOvrVal</description>
              <lsb>14</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TXMODOVREN</name>
              <description>txModOvrEn</description>
              <lsb>16</lsb>
              <msb>16</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CONFIG</name>
          <description>Misc RX config</description>
          <addressOffset>0x59C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00110020</resetValue>
          <fields>
            <field>
              <name>TBD</name>
              <description>Deprecated field -  Set to '1' if high-side LO</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>RFMIXHIGHSIDE</name>
              <description>Swap MIX_In and MIX_IP outputs if high (enables use of 'high side' mixing)</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>ADCCUR</name>
              <description>adcCur</description>
              <lsb>16</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>CALPHISIGN</name>
              <description>If '1', then the sign of the phase correction value in RxIQMix is inverted</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>NARROWCHFILT</name>
              <description>if '1', the channel filter is slightly narrowed</description>
              <lsb>28</lsb>
              <msb>28</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DAB[%s]</name>
          <description>Description collection: Device address base segment n</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DAB</name>
              <description>Device address base segment n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DAP[%s]</name>
          <description>Description collection: Device address prefix n</description>
          <addressOffset>0x620</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DAP</name>
              <description>Device address prefix n</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DACNF</name>
          <description>Device address match configuration</description>
          <addressOffset>0x640</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENA0</name>
              <description>Enable or disable device address matching using device address 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA1</name>
              <description>Enable or disable device address matching using device address 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA2</name>
              <description>Enable or disable device address matching using device address 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA3</name>
              <description>Enable or disable device address matching using device address 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA4</name>
              <description>Enable or disable device address matching using device address 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA5</name>
              <description>Enable or disable device address matching using device address 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA6</name>
              <description>Enable or disable device address matching using device address 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA7</name>
              <description>Enable or disable device address matching using device address 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXADD0</name>
              <description>TxAdd for device address 0</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>TXADD1</name>
              <description>TxAdd for device address 1</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>TXADD2</name>
              <description>TxAdd for device address 2</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>TXADD3</name>
              <description>TxAdd for device address 3</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>TXADD4</name>
              <description>TxAdd for device address 4</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>TXADD5</name>
              <description>TxAdd for device address 5</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>TXADD6</name>
              <description>TxAdd for device address 6</description>
              <lsb>14</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>TXADD7</name>
              <description>TxAdd for device address 7</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRWINSIZE</name>
          <description>address match safe window size (the number of bits after detect is asserted, before starting to look for address match). Only valid when OVERRIDE22.DISABLEADDRWINDOW is '0'</description>
          <addressOffset>0x64C</addressOffset>
          <access>read-write</access>
          <resetValue>0x1D111518</resetValue>
          <fields>
            <field>
              <name>BLE</name>
              <description>Number of bits after detect to start search address/SFD in BLE mode</description>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>ESB</name>
              <description>Number of bits after detect to start search address/SFD in ESB mode</description>
              <lsb>24</lsb>
              <msb>28</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODECNF0</name>
          <description>Radio mode configuration register 0</description>
          <addressOffset>0x650</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <fields>
            <field>
              <name>RU</name>
              <description>Radio ramp-up time</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Default ramp-up time (tRXEN and tTXEN), compatible with firmware written for nRF51</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Fast</name>
                  <description>Fast ramp-up (tRXEN,FAST and tTXEN,FAST), see electrical specification for more information</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECO</name>
              <description>Energy mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Default energy mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Eco</name>
                  <description>Eco (energy) mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTX</name>
              <description>Default TX value</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B1</name>
                  <description>Transmit '1'</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B0</name>
                  <description>Transmit '0'</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Center</name>
                  <description>Transmit center frequency</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXDISABLETIME</name>
              <description>Transition time from TXDISABLE state to DISABLED state</description>
              <lsb>16</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>RXDISABLETIME</name>
              <description>Transition time from RXDISABLE state to DISABLED state</description>
              <lsb>24</lsb>
              <msb>28</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODECNF1</name>
          <description>Radio mode configuration register 1</description>
          <addressOffset>0x654</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ZEROIF</name>
              <description>TBD</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Default mode (heterodyne)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZeroIF</name>
                  <description>Zero-IF mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSEL</name>
              <description>Sideband select</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Low-side LO</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>High-side LO</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_TOGGLE</name>
          <description>Constant AGC Gain switching, Debug</description>
          <addressOffset>0x704</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AGC_TOGGLE</name>
              <description>Enable or disable functional testmode for AGC</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_EN</name>
          <description>AGC enable</description>
          <addressOffset>0x708</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>AGC_EN</name>
              <description>Enable or disable AGC</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_OVERRIDE</name>
          <description>Gain setting</description>
          <addressOffset>0x70C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000730</resetValue>
          <fields>
            <field>
              <name>AGCLNAOVERRIDE</name>
              <description>Override for Lna gain</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>AGCMIXOVERRIDE</name>
              <description>Override for Mix gain</description>
              <lsb>4</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>AGCAAFOVERRIDE</name>
              <description>Override for Aaf gain</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE0</name>
          <description>Trim value override register 0 for nRF52</description>
          <addressOffset>0x724</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006C08</resetValue>
          <fields>
            <field>
              <name>TPWRUPFS</name>
              <description>Override for tPwrupFs</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TPWRUPTXPA</name>
              <description>Override for tPwrupTxPa</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TPWRUP_PB_0V9</name>
              <description>Override for tPWRUP_PB_0V9</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE1</name>
          <description>Trim value override register 1 for nRF52</description>
          <addressOffset>0x728</addressOffset>
          <access>read-write</access>
          <resetValue>0x00680000</resetValue>
          <fields>
            <field>
              <name>TPWRUPTX</name>
              <description>Override for tPwrupTx</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
