adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001.svd
        <cluster>
          <name>DEBUGPSEL</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_DEBUGPSEL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>CLOCK</name>
            <description>Pin select for RADIO clock (direct mode, base band debug. Refer to digip_064 and digip_061, txCk and ckDataIn signals)</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA</name>
            <description>Pin select for RADIO data (direct mode, base band debug. Refer to digip_064 and digip_061, txRadioData and dataIn signals)</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>ATEPANTHER</name>
          <description>Analog test bus control for Panther radio</description>
          <addressOffset>0x81C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ATERXMIX</name>
              <description>ateRxMix: Enable RXMix test mode when &amp;gt;0</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>ATERXAAF</name>
              <description>ateRxAaf: Enable RXAAF test mode when &amp;gt;0</description>
              <lsb>8</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>ATEFS</name>
              <description>ateFs: Configuration register for automatic test bus</description>
              <lsb>16</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>ATEPB</name>
              <description>atePb</description>
              <lsb>25</lsb>
              <msb>26</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RFMATCHTUNE</name>
          <description>Adjust transformation ratio of on-chip matching Can be used for: 1) Optimise power consumption for different output power levels in TX mode 2) Optimise input impedance in RX mode.</description>
          <addressOffset>0x828</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RFMATCHTUNETX</name>
              <description>Antenna match tuning for TX mode</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>RFMATCHTUNERX</name>
              <description>Antenna match tuning for RX mode</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DFEMODE</name>
          <description>Whether to use Angle-of-Arrival (AOA) or Angle-of-Departure (AOD)</description>
          <addressOffset>0x900</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DFEOPMODE</name>
              <description>Direction finding operation mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Direction finding mode disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AoD</name>
                  <description>Direction finding mode set to AoD</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AoA</name>
                  <description>Direction finding mode set to AoA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTEINLINECONF</name>
          <description>Configuration for CTE inline mode</description>
          <addressOffset>0x904</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002800</resetValue>
          <fields>
            <field>
              <name>CTEINLINECTRLEN</name>
              <description>Enable parsing of CTEInfo from received packet in BLE modes</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Parsing of CTEInfo is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Parsing of CTEInfo is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEINFOINS1</name>
              <description>CTEInfo is S1 byte or not</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InS1</name>
                  <description>CTEInfo is in S1 byte (data PDU)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotInS1</name>
                  <description>CTEInfo is NOT in S1 byte (advertising PDU)</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEERRORHANDLING</name>
              <description>Sampling/switching if CRC is not OK</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Yes</name>
                  <description>Sampling and antenna switching also when CRC is not OK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>No</name>
                  <description>No sampling and antenna switching when CRC is not OK</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEFORCEON</name>
              <description>CTE is continuously output after CRC and only stopped by triggering TASKS_STOP. This is typically used together with the DFEEND to STOP short. AoA/AoD procedure duration is still controlled by DFECTRL1.NUMBEROF8S / CTETIME</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Yes</name>
                  <description>CTE is continuously transmitted after CRC until TASKS_STOP</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>No</name>
                  <description>CTE duration is automatically determined by DFECTRL1.NUMBEROF8US / CTETIME (only correct for 1Mbps and 2Mbps modes)</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTETIMEVALIDRANGE</name>
              <description>Max range of CTETime</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>20</name>
                  <description>20 in 8us unit (default) Set to 20 if parsed CTETime is larger han 20</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>31 in 8us unit</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>63</name>
                  <description>63 in 8us unit</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEINLINERXMODE1US</name>
              <description>Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set</description>
              <lsb>10</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8us</name>
                  <description>8us</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125ns</name>
                  <description>0.125us</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEINLINERXMODE2US</name>
              <description>Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8us</name>
                  <description>8us</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125ns</name>
                  <description>0.125us</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S0CONF</name>
              <description>S0 bit pattern to match</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>S0MASK</name>
              <description>S0 bit mask to set which bit to match</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DFECTRL1</name>
          <description>Various configuration for Direction finding</description>
          <addressOffset>0x910</addressOffset>
          <access>read-write</access>
          <resetValue>0x00023282</resetValue>
          <fields>
            <field>
              <name>NUMBEROF8US</name>
              <description>Length of the AoA/AoD procedure in number of 8 us units</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>DFEINEXTENSION</name>
              <description>Add CTE extension and do antenna switching/sampling in this extension</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC</name>
                  <description>AoA/AoD procedure triggered at end of CRC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Payload</name>
                  <description>Antenna switching/sampling is done in the packet payload</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSWITCHSPACING</name>
              <description>Interval between every time the antenna is changed in the SWITCHING state</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8us</name>
                  <description>8us</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERWITHTASKONLY</name>
              <description>Trigger AoA/AoD procedure using only task</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OnlyTask</name>
                  <description>Only allow triggering a procedure with TASKS_DFESTART</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Multiple</name>
                  <description>Trigger also with other signals</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSAMPLESPACINGREF</name>
              <description>Interval between samples in the REFERENCE period</description>
              <lsb>12</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8us</name>
                  <description>8us</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125ns</name>
                  <description>0.125us</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLETYPE</name>
              <description>Whether to sample I/Q or magnitude/phase</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IQ</name>
                  <description>Complex samples in I and Q</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MagPhase</name>
                  <description>Complex samples as magnitude and phase</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSAMPLESPACING</name>
              <description>Interval between samples in the SWITCHING period when CTEINLINECTRLEN is 0</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125ns</name>
                  <description>0.125us</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REPEATPATTERN</name>
              <description>Repeat each individual antenna pattern N times sequentially, i.e. P0, P0, P1, P1, P2, P2, P3, P3, etc.</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoRepeat</name>
                  <description>Do not repeat (1 time in total)</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGCBACKOFFGAIN</name>
              <description>Gain will be lowered by the specified number of gain steps at the start of CTE</description>
              <lsb>24</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DFECTRL2</name>
          <description>Start offset for Direction finding</description>
          <addressOffset>0x914</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSWITCHOFFSET</name>
              <description>Signed value offset after the end of the CRC before starting switching in number of 16M cycles</description>
              <lsb>0</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>TSAMPLEOFFSET</name>
              <description>Signed value offset before starting sampling in number of 16M cycles relative to the beginning of the REFERENCE state - 12 us after switching start</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
