adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001.svd
        <register>
          <dim>0x6</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CHG[%s]</name>
          <description>Description collection: Channel group n Note: Writes to this register are ignored if either SUBSCRIBE_CHG[n].EN or SUBSCRIBE_CHG[n].DIS is enabled</description>
          <addressOffset>0x800</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0</name>
              <description>Include or exclude channel 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1</name>
              <description>Include or exclude channel 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH2</name>
              <description>Include or exclude channel 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH3</name>
              <description>Include or exclude channel 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH4</name>
              <description>Include or exclude channel 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH5</name>
              <description>Include or exclude channel 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH6</name>
              <description>Include or exclude channel 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH7</name>
              <description>Include or exclude channel 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH8</name>
              <description>Include or exclude channel 8</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH9</name>
              <description>Include or exclude channel 9</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH10</name>
              <description>Include or exclude channel 10</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH11</name>
              <description>Include or exclude channel 11</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH12</name>
              <description>Include or exclude channel 12</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH13</name>
              <description>Include or exclude channel 13</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH14</name>
              <description>Include or exclude channel 14</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH15</name>
              <description>Include or exclude channel 15</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
