adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UARTE0</name>
      <description>UART with EasyDMA</description>
      <baseAddress>0x4000E000</baseAddress>
      <alternatePeripheral>SPIM0</alternatePeripheral>
      <headerStructName>UARTE</headerStructName>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPIM0_SPIS0_UARTE0</name>
        <value>14</value>
      </interrupt>
      <groupName>UARTE</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_STARTRX</name>
          <description>Start UART receiver</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STARTRX</name>
              <description>Start UART receiver</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOPRX</name>
          <description>Stop UART receiver</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STOPRX</name>
              <description>Stop UART receiver</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STARTTX</name>
          <description>Start UART transmitter</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STARTTX</name>
              <description>Start UART transmitter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOPTX</name>
          <description>Stop UART transmitter</description>
          <addressOffset>0x00C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STOPTX</name>
              <description>Stop UART transmitter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_SUSPEND</name>
          <description>Suspend UART transaction</description>
          <addressOffset>0x01C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_SUSPEND</name>
              <description>Suspend UART transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_RESUME</name>
          <description>Resume UART transaction</description>
          <addressOffset>0x020</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_RESUME</name>
              <description>Resume UART transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_FLUSHRX</name>
          <description>Flush RX FIFO into RX buffer</description>
          <addressOffset>0x02C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_FLUSHRX</name>
              <description>Flush RX FIFO into RX buffer</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STARTRX</name>
          <description>Subscribe configuration for task STARTRX</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task STARTRX will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STOPRX</name>
          <description>Subscribe configuration for task STOPRX</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task STOPRX will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STARTTX</name>
          <description>Subscribe configuration for task STARTTX</description>
          <addressOffset>0x088</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task STARTTX will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STOPTX</name>
          <description>Subscribe configuration for task STOPTX</description>
          <addressOffset>0x08C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task STOPTX will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_SUSPEND</name>
          <description>Subscribe configuration for task SUSPEND</description>
          <addressOffset>0x09C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task SUSPEND will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_RESUME</name>
          <description>Subscribe configuration for task RESUME</description>
          <addressOffset>0x0A0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task RESUME will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_FLUSHRX</name>
          <description>Subscribe configuration for task FLUSHRX</description>
          <addressOffset>0x0AC</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task FLUSHRX will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_CTS</name>
          <description>CTS is activated (set low). Clear To Send.</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_CTS</name>
              <description>CTS is activated (set low). Clear To Send.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_NCTS</name>
          <description>CTS is deactivated (set high). Not Clear To Send.</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_NCTS</name>
              <description>CTS is deactivated (set high). Not Clear To Send.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RXDRDY</name>
          <description>Data received in RXD (but potentially not yet transferred to Data RAM)</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RXDRDY</name>
              <description>Data received in RXD (but potentially not yet transferred to Data RAM)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_ENDRX</name>
          <description>Receive buffer is filled up</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_ENDRX</name>
              <description>Receive buffer is filled up</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_TXDRDY</name>
          <description>Data sent from TXD</description>
          <addressOffset>0x11C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_TXDRDY</name>
              <description>Data sent from TXD</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_ENDTX</name>
          <description>Last TX byte transmitted</description>
          <addressOffset>0x120</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_ENDTX</name>
              <description>Last TX byte transmitted</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_ERROR</name>
          <description>Error detected</description>
          <addressOffset>0x124</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_ERROR</name>
              <description>Error detected</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RXTO</name>
          <description>Receiver timeout</description>
          <addressOffset>0x144</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RXTO</name>
              <description>Receiver timeout</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RXSTARTED</name>
          <description>UART receiver has started</description>
          <addressOffset>0x14C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RXSTARTED</name>
              <description>UART receiver has started</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_TXSTARTED</name>
          <description>UART transmitter has started</description>
          <addressOffset>0x150</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_TXSTARTED</name>
              <description>UART transmitter has started</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
