adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USBD</name>
      <description>Universal serial bus device</description>
      <baseAddress>0x40011000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USBD</name>
        <value>17</value>
      </interrupt>
      <groupName>USBD</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_STARTEPIN[%s]</name>
          <description>Description collection: Captures the EPIN[n].PTR and EPIN[n].MAXCNT registers values, and enables endpoint IN n to respond to traffic from host EPIN[n].CONFIG is also captured</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STARTEPIN</name>
              <description>Captures the EPIN[n].PTR and EPIN[n].MAXCNT registers values, and enables endpoint IN n to respond to traffic from host EPIN[n].CONFIG is also captured</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STARTISOIN</name>
          <description>Captures the ISOIN.PTR and ISOIN.MAXCNT registers values, and enables sending data on ISO endpoint ISOIN.CONFIG is also captured</description>
          <addressOffset>0x024</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STARTISOIN</name>
              <description>Captures the ISOIN.PTR and ISOIN.MAXCNT registers values, and enables sending data on ISO endpoint ISOIN.CONFIG is also captured</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_STARTEPOUT[%s]</name>
          <description>Description collection: Captures the EPOUT[n].PTR and EPOUT[n].MAXCNT registers values, and enables endpoint n to respond to traffic from host EPOUT[n].CONFIG is also captured</description>
          <addressOffset>0x028</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STARTEPOUT</name>
              <description>Captures the EPOUT[n].PTR and EPOUT[n].MAXCNT registers values, and enables endpoint n to respond to traffic from host EPOUT[n].CONFIG is also captured</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STARTISOOUT</name>
          <description>Captures the ISOOUT.PTR and ISOOUT.MAXCNT registers values, and enables receiving of data on ISO endpoint ISOOUT.CONFIG is also captured</description>
          <addressOffset>0x048</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STARTISOOUT</name>
              <description>Captures the ISOOUT.PTR and ISOOUT.MAXCNT registers values, and enables receiving of data on ISO endpoint ISOOUT.CONFIG is also captured</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_EP0RCVOUT</name>
          <description>Allows OUT data stage on control endpoint 0</description>
          <addressOffset>0x04C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_EP0RCVOUT</name>
              <description>Allows OUT data stage on control endpoint 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_EP0STATUS</name>
          <description>Allows status stage on control endpoint 0</description>
          <addressOffset>0x050</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_EP0STATUS</name>
              <description>Allows status stage on control endpoint 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_EP0STALL</name>
          <description>Stalls data and status stage on control endpoint 0</description>
          <addressOffset>0x054</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_EP0STALL</name>
              <description>Stalls data and status stage on control endpoint 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DPDMDRIVE</name>
          <description>Forces D+ and D- lines into the state defined in the DPDMVALUE register</description>
          <addressOffset>0x058</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DPDMDRIVE</name>
              <description>Forces D+ and D- lines into the state defined in the DPDMVALUE register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DPDMNODRIVE</name>
          <description>Stops forcing D+ and D- lines into any state (USB engine takes control)</description>
          <addressOffset>0x05C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DPDMNODRIVE</name>
              <description>Stops forcing D+ and D- lines into any state (USB engine takes control)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_TRIG_ZERO_PENALTY_DIG4</name>
          <description>PcgcSlaveDig zero penalty</description>
          <addressOffset>0x60</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TASK_TRIG_FULL_PENALTY_DIG4</name>
          <description>PcgcSlaveDig full penalty</description>
          <addressOffset>0x64</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TASK_TRIG_ZERO_PENALTY_DIG3</name>
          <description>PcgcSlaveDig zero penalty</description>
          <addressOffset>0x68</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TASK_TRIG_FULL_PENALTY_DIG3</name>
          <description>PcgcSlaveDig full penalty</description>
          <addressOffset>0x6C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TASK_TRIG_ZERO_PENALTY_DIG2</name>
          <description>PcgcSlaveDig zero penalty</description>
          <addressOffset>0x70</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TASK_TRIG_FULL_PENALTY_DIG2</name>
          <description>PcgcSlaveDig full penalty</description>
          <addressOffset>0x74</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TASK_TRIG_ZERO_PENALTY_DIG1</name>
          <description>PcgcSlaveDig zero penalty</description>
          <addressOffset>0x78</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TASK_TRIG_FULL_PENALTY_DIG1</name>
          <description>PcgcSlaveDig full penalty</description>
          <addressOffset>0x7C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SUBSCRIBE_STARTEPIN[%s]</name>
          <description>Description collection: Subscribe configuration for task STARTEPIN[n]</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task STARTEPIN[n] will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STARTISOIN</name>
          <description>Subscribe configuration for task STARTISOIN</description>
          <addressOffset>0x0A4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task STARTISOIN will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SUBSCRIBE_STARTEPOUT[%s]</name>
          <description>Description collection: Subscribe configuration for task STARTEPOUT[n]</description>
          <addressOffset>0x0A8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task STARTEPOUT[n] will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STARTISOOUT</name>
          <description>Subscribe configuration for task STARTISOOUT</description>
          <addressOffset>0x0C8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task STARTISOOUT will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_EP0RCVOUT</name>
          <description>Subscribe configuration for task EP0RCVOUT</description>
          <addressOffset>0x0CC</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task EP0RCVOUT will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_EP0STATUS</name>
          <description>Subscribe configuration for task EP0STATUS</description>
          <addressOffset>0x0D0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task EP0STATUS will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_EP0STALL</name>
          <description>Subscribe configuration for task EP0STALL</description>
          <addressOffset>0x0D4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task EP0STALL will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DPDMDRIVE</name>
          <description>Subscribe configuration for task DPDMDRIVE</description>
          <addressOffset>0x0D8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task DPDMDRIVE will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DPDMNODRIVE</name>
          <description>Subscribe configuration for task DPDMNODRIVE</description>
          <addressOffset>0x0DC</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task DPDMNODRIVE will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_TRIG_ZERO_PENALTY_MAIN1</name>
          <description>PcgcSlaveMain zero penalty</description>
          <addressOffset>0xE0</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TASK_TRIG_FULL_PENALTY_MAIN1</name>
          <description>PcgcSlaveMain full penalty</description>
          <addressOffset>0xE4</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_USBRESET</name>
          <description>Signals that a USB reset condition has been detected on USB lines</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_USBRESET</name>
              <description>Signals that a USB reset condition has been detected on USB lines</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_STARTED</name>
          <description>Confirms that the EPIN[n].PTR and EPIN[n].MAXCNT, or EPOUT[n].PTR and EPOUT[n].MAXCNT registers have been captured on all endpoints reported in the EPSTATUS register EPIN[n].CONFIG is also confirmed captured</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_STARTED</name>
              <description>Confirms that the EPIN[n].PTR and EPIN[n].MAXCNT, or EPOUT[n].PTR and EPOUT[n].MAXCNT registers have been captured on all endpoints reported in the EPSTATUS register EPIN[n].CONFIG is also confirmed captured</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
