adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001.svd
        <register>
          <name>EPSTALL</name>
          <description>STALL endpoints</description>
          <addressOffset>0x518</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>EP</name>
              <description>Select endpoint number</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>IO</name>
              <description>Selects IN or OUT endpoint</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Out</name>
                  <description>Selects OUT endpoint</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>In</name>
                  <description>Selects IN endpoint</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STALL</name>
              <description>Stall selected endpoint</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UnStall</name>
                  <description>Don't stall selected endpoint</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stall</name>
                  <description>Stall selected endpoint</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ISOSPLIT</name>
          <description>Controls the split of ISO buffers</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPLIT</name>
              <description>Controls the split of ISO buffers</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OneDir</name>
                  <description>Full buffer dedicated to either iso IN or OUT</description>
                  <value>0x0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HalfIN</name>
                  <description>Lower half for IN, upper half for OUT</description>
                  <value>0x0080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HalfOUT</name>
                  <description>Lower half for OUT, upper half for IN</description>
                  <value>0x8000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QuartIN</name>
                  <description>Lower 25 percent for IN, upper 75 percent for OUT</description>
                  <value>0x0040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QuartOUT</name>
                  <description>Lower 25 percent for OUT, upper 75 percent for IN</description>
                  <value>0x4000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAMECNTR</name>
          <description>Returns the current value of the start of frame counter</description>
          <addressOffset>0x520</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>FRAMECNTR</name>
              <description>Returns the current value of the start of frame counter</description>
              <lsb>0</lsb>
              <msb>10</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTUSBPULLUP</name>
          <description>Control of the USB pull-up value, for test purposes</description>
          <addressOffset>0x524</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Control of the value of USB pull-up on the D+ line (for test mode)</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Auto</name>
                  <description>MAC controls the value of the pull-up (no override)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BusActive</name>
                  <description>Pull-up value is 1425 to 3090 Ohm</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BusIdle</name>
                  <description>Pull-up is Resume in 900 to 1575 Ohm</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TSEL</name>
          <description>Trim value for ramTSEL[1:0] on the RamBist interface</description>
          <addressOffset>0x528</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>RAMTSEL</name>
              <description>Trim value for ramTSEL[1:0] on the RamBist interface (tSelInUsb lines). This register shall only get written while USBD is not enabled.</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LOWPOWER</name>
          <description>Controls USBD peripheral low power mode during USB suspend</description>
          <addressOffset>0x52C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LOWPOWER</name>
              <description>Controls USBD peripheral low-power mode during USB suspend</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ForceNormal</name>
                  <description>Software must write this value to exit low power mode and before performing a remote wake-up</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LowPower</name>
                  <description>Software must write this value to enter low power mode after DMA and software have finished interacting with the USB peripheral</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ISOINCONFIG</name>
          <description>Controls the response of the ISO IN endpoint to an IN token when no data is ready to be sent</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESPONSE</name>
              <description>Controls the response of the ISO IN endpoint to an IN token when no data is ready to be sent</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoResp</name>
                  <description>Endpoint does not respond in that case</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZeroData</name>
                  <description>Endpoint responds with a zero-length data packet in that case</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x014</dimIncrement>
          <name>EPIN[%s]</name>
          <description>Unspecified</description>
          <headerStructName>USBD_EPIN</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>PTR</name>
            <description>Description cluster: Data pointer</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Description cluster: Maximum number of bytes to transfer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of bytes to transfer</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Description cluster: Number of bytes transferred in the last transaction</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes transferred in the last transaction</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>Description cluster: Endpoint EasyDMA configuration</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DMASIZE</name>
                <description>DMA transfer size</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Byte</name>
                    <description>DMA transfer size is 8 bits</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Short</name>
                    <description>DMA transfer size is 16 bits (buffer must be aligned accordingly)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Long</name>
                    <description>DMA transfer size is 32 bits (buffer must be aligned accordingly)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LIST</name>
            <description>Description cluster: EasyDMA list type</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>LIST</name>
                <description>List type</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Normal EasyDMA operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ArrayList</name>
                    <description>Use array list (auto-increment of .PTR)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>ISOIN</name>
          <description>Unspecified</description>
          <headerStructName>USBD_ISOIN</headerStructName>
          <access>read-write</access>
          <addressOffset>0x6A0</addressOffset>
          <register>
            <name>PTR</name>
            <description>Data pointer</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Maximum number of bytes to transfer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of bytes to transfer</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of bytes transferred in the last transaction</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes transferred in the last transaction</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>Isochronous endpoint EasyDMA configuration</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DMASIZE</name>
                <description>DMA transfer size</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Byte</name>
                    <description>DMA transfer size is 8 bits</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Short</name>
                    <description>DMA transfer size is 16 bits (buffer must be aligned accordingly)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Long</name>
                    <description>DMA transfer size is 32 bits (buffer must be aligned accordingly)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x014</dimIncrement>
          <name>EPOUT[%s]</name>
          <description>Unspecified</description>
          <headerStructName>USBD_EPOUT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x700</addressOffset>
          <register>
            <name>PTR</name>
            <description>Description cluster: Data pointer</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Description cluster: Maximum number of bytes to transfer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of bytes to transfer</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Description cluster: Number of bytes transferred in the last transaction</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes transferred in the last transaction</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>Description cluster: Endpoint EasyDMA configuration</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DMASIZE</name>
                <description>DMA transfer size</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Byte</name>
                    <description>DMA transfer size is 8 bit</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Short</name>
                    <description>DMA transfer size is 16 bit (buffer must be aligned accordingly)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Long</name>
                    <description>DMA transfer size is 32 bit (buffer must be aligned accordingly)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LIST</name>
            <description>Description cluster: EasyDMA list type</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>LIST</name>
                <description>List type</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Normal EasyDMA operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ArrayList</name>
                    <description>Use array list (auto-increment of .PTR)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>ISOOUT</name>
          <description>Unspecified</description>
          <headerStructName>USBD_ISOOUT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x7A0</addressOffset>
          <register>
            <name>PTR</name>
            <description>Data pointer</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Maximum number of bytes to transfer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of bytes to transfer</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of bytes transferred in the last transaction</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes transferred in the last transaction</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>Isochronous endpoint EasyDMA configuration</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DMASIZE</name>
                <description>DMA transfer size</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Byte</name>
                    <description>DMA transfer size is 8 bits</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Short</name>
                    <description>DMA transfer size is 16 bits (buffer must be aligned accordingly)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Long</name>
                    <description>DMA transfer size is 32 bits (buffer must be aligned accordingly)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>RAWADDR</name>
          <description>Address to be used for accessing the MAC IP4000</description>
          <addressOffset>0x800</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <description>IP4000 address space</description>
              <lsb>0</lsb>
              <msb>10</msb>
            </field>
          </fields>
        </register>
