adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001.svd
        <register>
          <name>RAWDATA</name>
          <description>Actual read or write access to the raw IP, using RAWADDR address</description>
          <addressOffset>0x804</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>data</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x5</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PENALTY_DIG[%s]</name>
          <description>Description collection: PcgcSlaveDig</description>
          <addressOffset>0xC00</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PENALTY_DIG</name>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTO0</name>
                  <description>Full penalty: Power core, Power switch, Clock core, Clock buffer and Clock switch can turn off</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO1</name>
                  <description>Clock core, Clock buffer and Clock switch can turn off, Power core and Power switch are kept on</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO2</name>
                  <description>Clock buffer and Clock switch can turn off, Power core, Power switch and Clock core are kept on</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO3</name>
                  <description>Zero penalty: Clock switch can turn off, Power core, Power switch, Clock core and Clock buffer are kept on</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNUSED</name>
              <description>Unused bits, always reads as ones</description>
              <lsb>2</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PENALTY_MAIN0[%s]</name>
          <description>Description collection: PcgcSlaveMain</description>
          <addressOffset>0xC14</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PENALTY_DIG1</name>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTO0</name>
                  <description>Full penalty: Power core, Power switch, Clock core, Clock buffer and Clock switch can turn off</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO1</name>
                  <description>Clock core, Clock buffer and Clock switch can turn off, Power core and Power switch are kept on</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO2</name>
                  <description>Clock buffer and Clock switch can turn off, Power core, Power switch and Clock core are kept on</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO3</name>
                  <description>Zero penalty: Clock switch can turn off, Power core, Power switch, Clock core and Clock buffer are kept on</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNUSED</name>
              <description>Unused bits, always reads as ones</description>
              <lsb>2</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x5</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FORCE_OVERRIDE_DIG[%s]</name>
          <description>Description collection: Clock and power request override register for PCPn in PcgcSlaveDig</description>
          <addressOffset>0xC1C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLOCKFORCINGSWITCH_A</name>
              <description>Force clockRequest[n].switch_a if doForceClock is set. If doForceClock is not set, clockRequest[n].switch_a is not overridden.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ForceLow</name>
                  <description>Forces clockRequest[n].switch_a is overridden to 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceHigh</name>
                  <description>Forces clockRequest[n].switch_a is overridden to 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCKFORCINGSWITCH</name>
              <description>Force clockRequest[n].switch if doForceClock is set. If doForceClock is not set, clockRequest[n].switch is not overridden.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ForceLow</name>
                  <description>Forces clockRequest[n].switch is overridden to 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceHigh</name>
                  <description>Forces clockRequest[n].switch is overridden to 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCKFORCINGBUFF</name>
              <description>Force clockRequest[n].buff if doForceClock is set. If doForceClock is not set, clockRequest[n].buff is not overridden.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ForceLow</name>
                  <description>Forces clockRequest[n].buff is overridden to 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceHigh</name>
                  <description>Forces clockRequest[n].buff is overridden to 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCKFORCINGCORE</name>
              <description>Force clockRequest[n].core if doForceClock is set. If doForceClock is not set, clockRequest[n].core is not overridden.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ForceLow</name>
                  <description>Forces clockRequest[n].core is overridden to 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceHigh</name>
                  <description>Forces clockRequest[n].core is overridden to 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOFORCECLOCK</name>
              <description>Enable or disable the forcing of clock request signals</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable forcing of the clock request signals</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable forcing of the clock request signals</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POWERFORCINGSWITCH</name>
              <description>Force powerRequest[n].switch If doForcePower is set. If doForcePower is not set, powerRequest[n].switch is not overridden.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ForceLow</name>
                  <description>Forces powerRequest[n].switch is overridden to 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceHigh</name>
                  <description>Forces powerRequest[n].switch is overridden to 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POWERFORCINGCORE</name>
              <description>Force powerRequest[n].core if doForcePower is set. If doForcePower is not set, powerRequest[n].core is not overridden.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ForceLow</name>
                  <description>Forces powerRequest[n].core is overridden to 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceHigh</name>
                  <description>Forces powerRequest[n].core is overridden to 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOFORCEPOWER</name>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable forcing of the power request signals</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable forcing of the power request signals</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FORCE_OVERRIDE_MAIN[%s]</name>
          <description>Description collection: Similar to FORCE_OVERRIDE_DIG[0] but for PCP0 in PcgcSlaveMain</description>
          <addressOffset>0xC30</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TURN_OFF_AUTO_CLOCKSOURCE_REQ</name>
          <description>Unused</description>
          <addressOffset>0xC7C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>UNUSED</name>
              <description>Always reads as zero</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
